var allRoles = [
{
	"id": 0,
	"force": "在野",
	"people": [
		{"name": "在野"}
	]
}, {
	"id": 1,
	"force": "三国-魏",
	"people": [
		{"name": "曹操"},{"name": "郭嘉"},{"name": "贾诩"},{"name": "张辽"},{"name": "夏侯惇"},{"name": "典韦"},{"name": "蔡琰"}
	]
}, {
	"id": 2,
	"force": "三国-蜀",
	"people": [
		{"name": "刘备"},{"name": "徐庶"},{"name": "庞统"},{"name": "关羽"},{"name": "张飞"},{"name": "赵云"},{"name": "糜氏"}
	]
}, {
	"id": 3,
	"force": "三国-吴",
	"people": [
		{"name": "孙坚"},{"name": "周瑜"},{"name": "吕蒙"},{"name": "太史慈"},{"name": "甘宁"},{"name": "黄盖"},{"name": "小乔"}
	]
}, {
	"id": 4,
	"force": "EX",
	"people": [
		{"name": "EX"}
	]
}, {
	"id": 5,
	"force": "群雄-曹操",
	"people": [
		{"name": "曹操"},{"name": "郭嘉"},{"name": "程昱"},{"name": "于禁"},{"name": "夏侯惇"},{"name": "典韦"},{"name": "卞氏"}
	]
}, {
	"id": 6,
	"force": "群雄-刘备",
	"people": [
		{"name": "刘备"},{"name": "徐庶"},{"name": "庞统"},{"name": "关羽"},{"name": "张飞"},{"name": "赵云"},{"name": "糜氏"}
	]
}, {
	"id": 7,
	"force": "群雄-孙坚",
	"people": [
		{"name": "孙坚"},{"name": "周瑜"},{"name": "吕蒙/程普"},{"name": "太史慈"},{"name": "甘宁"},{"name": "黄盖"},{"name": "小乔"}
	]
}, {
	"id": 8,
	"force": "群雄-公孙瓒",
	"people": [
		{"name": "公孙瓒"},{"name": "公孙康"},{"name": "关靖"},{"name": "公孙范"},{"name": "严纲"},{"name": "单经"},{"name": "蔡琰"}
	]
}, {
	"id": 9,
	"force": "群雄-袁绍",
	"people": [
		{"name": "袁绍"},{"name": "沮授"},{"name": "许攸"},{"name": "颜良"},{"name": "麴义"},{"name": "蒋义渠"},{"name": "甄宓"}
	]
}, {
	"id": 10,
	"force": "群雄-刘表",
	"people": [
		{"name": "刘表"},{"name": "蒯良"},{"name": "黄祖"},{"name": "蔡瑁张允"},{"name": "刘磐"},{"name": "吕公"},{"name": "蔡氏"}
	]
}, {
	"id": 11,
	"force": "群雄-董卓",
	"people": [
		{"name": "董卓"},{"name": "李儒"},{"name": "皇甫嵩"},{"name": "吕布"},{"name": "华雄"},{"name": "郭汜"},{"name": "邹氏"}
	]
}, {
	"id": 12,
	"force": "群雄-马腾",
	"people": [
		{"name": "马腾"},{"name": "成公英"},{"name": "边章"},{"name": "马超"},{"name": "马休"},{"name": "马铁"},{"name": "王异"}
	]
}, {
	"id": 13,
	"force": "群雄-刘焉",
	"people": [
		{"name": "刘焉"},{"name": "张松"},{"name": "王累"},{"name": "张任"},{"name": "吴懿"},{"name": "杨怀"},{"name": "祝融"}
	]
}, {
	"id": 14,
	"force": "战国-织田",
	"people": [
		{"name": "织田信秀"},{"name": "平手政秀"},{"name": "林秀贞"},{"name": "村井贞胜"},
		{"name": "柴田胜家"},{"name": "佐久间信盛"},{"name": "池田恒兴"},{"name": "森可成"}
	]
}, {
	"id": 15,
	"force": "战国-德川",
	"people": [
		{"name": "松平广忠"},{"name": "石川数正"},{"name": "平岩亲吉"},{"name": "伊奈忠次"},
		{"name": "本多忠胜"},{"name": "神原康政"},{"name": "服部正成"},{"name": "鸟居元忠"}
	]
}, {
	"id": 16,
	"force": "战国-丰臣",
	"people": [
		{"name": "丰臣秀吉"},{"name": "竹中重治"},{"name": "蜂须贺正胜"},{"name": "浅野长政"},
		{"name": "加藤清正"},{"name": "福岛正则"},{"name": "加藤嘉明"},{"name": "山内一丰"}
	]
}, {
	"id": 17,
	"force": "战国-武田",
	"people": [
		{"name": "武田信虎"},{"name": "横田高松"},{"name": "板垣信方"},{"name": "武田信廉"},
		{"name": "甘利虎泰"},{"name": "饭富虎昌"},{"name": "原虎胤"},{"name": "诸角虎定"}
	]
}, {
	"id": 18,
	"force": "战国-上杉",
	"people": [
		{"name": "长尾为景"},{"name": "宇佐美定满"},{"name": "长尾政景"},{"name": "上杉宪政"},
		{"name": "柿崎景家"},{"name": "斋藤朝信"},{"name": "中条藤资"},{"name": "色部胜长"}
	]
}, {
	"id": 19,
	"force": "战国-北条",
	"people": [
		{"name": "北条早云"},{"name": "北条幻庵"},{"name": "大道寺盛昌"},{"name": "安藤良整"},
		{"name": "北条纲成"},{"name": "富永直胜"},{"name": "北条纲高"},{"name": "北条氏邦"}
	]
}, {
	"id": 20,
	"force": "战国-毛利",
	"people": [
		{"name": "毛利元就"},{"name": "福原贞俊"},{"name": "志道广良"},{"name": "口羽通良"},
		{"name": "吉川元春"},{"name": "国司元相"},{"name": "村上武吉"},{"name": "穗井田元清"}
	]
}
];